var fs = require('fs');

var contents = fs.readFileSync('voyahchat-antispam.txt', 'utf8');
//пᴏлʜᴏᴄтью ᴏфúцúᴀльный дᴏxᴏд

// B пoucкe людeй
var matches = {
    '\n': '',
    ' ': '[\\s ‍ ‌ ​]+',
    'а': '[αΑAАaа@ᴀ]',
    'б': '[ΒБб6]',
    'в': '[ΒBВв]',
    'г': '[Ггᴦ]',
    'д': '[Дд]',
    'е': '[ΕEЕeеᴇ]',
    'ё': '[ΕEЕЁeеᴇё]',
    'ж': '[Жж]',
    'з': '[ЗЗ3Зз]',
    'и': '[ИиUuú]',
    'й': '[ИиUuЙйú]',
    'к': '[ΚKКkкκᴋ]',
    'л': '[ΛЛлᴧ]',
    'м': '[MМmм]',
    'н': '[ΝHНн]',
    'о': '[οΟ0OoОоᴏ]',
    'п': '[𝜫Пп]',
    'р': '[ρΡPРpрᴩ]',
    'с': '[CcСсᴄ]',
    'т': '[ΤTtТтᴛm]',
    'у': '[YУyу]',
    'ф': '[Фф]',
    'х': '[XХxх]',
    'ц': '[Цц]',
    'ч': '[4Чч]',
    'ш': '[Шш]',
    'щ': '[Щщ]',
    'ъ': '[Ъъ]',
    'ы': '[Ыы]',
    'ь': '[Ьь]',
    'э': '[Ээ]',
    'ю': '[Юю]',
    'я': '[Яя]',
};

Object.keys(matches).forEach(s => contents = contents.replace(new RegExp(s, 'g'), matches[s]));

fs.writeFileSync('voyahchat-antispam-encoded.txt', contents);
